

async function printCharset(screen) {
  let chars =[32, 33, 34, 35, 36, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 
              52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 
              0, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 
              88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 
              105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 
              120, 121, 122, 123, 124, 125, 126, 163, 176, 177, 178, 179, 180, 181, 182, 
              183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 
              198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 
              213, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250];
  let x = 0;
  let y = 0;
  for (let i = 0; i < chars.length; i++) {
    let c = String.fromCharCode(chars[i]);

    await screen.set_char(x, y, c);

    x += 1;
    if (x >= screen.size.x) {
      x = 0;
      y += 1;
    }
  }
}

async function main() {
  let screen = new Screen('main');

  // screen.clear();
  // for (let i = 0; i < screen.size.y; i++)
  //   await screen.print('01234567890123456789012345678901');

  screen.clear();
  // printCharset(screen);

  // screen.clear();
  let level = [
    ' SCORE=00000            LIVES=3 ',
    '                                ',
    '                                ',
    '                                ',
    '    תתתHתתתתתתתתתתתת    תתתתתHתת',
    '       H                     H  ',
    '       H                     H  ',
    '       H                     H  ',
    'תתתתHתתתתתתתתתתHתתתתתתתתתתתתתתתת',
    '    H          H                ',
    '    H          H                ',
    'תHתתתתתת   תתתתתתתתHתת   תתתתתתת',
    ' H                 H            ',
    ' H                 H            ',
    'תתתHתתתתתתתתתת   תתתתת   תתHתתתת',
    '   H                       H    ',
    '   H                       H    ',
    ' תתתתתתתHתתתתת   תתתתHתתתתתתתת  ',
    '        H            H          ',
    '        H            H          ',
    'תHתתתתתתתתתתתתתHתתתתתתתתתתתתתHתת',
    ' H             H             H  ',
    ' H             H             H  ',
    '÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷',
  ];
  for (let i = 0; i < level.length; i++) {
    await screen.print(level[i]);
  }
}
